stm32-hotspot/STM32WBA-Advanced-BLE-Broadcast-Speaker/Middlewares/ST/Audio-Kit/src/helpers/stm32_term_acsdk_tuner.c
/**
******************************************************************************
* @file          stm32_term_acsdk_tuner.c
* @author        MCD Application Team
* @brief         general purpose commands
*******************************************************************************
*
*
This code supports a fine tuning using live tune, in this mode live tune is able  to modify parameters only.
There are some elements not displayed on the interface due to the live tuning configuration ( no database ).
Connections are shown  but not modifiable,  All non-audio chain elements such as viewer are not shown too.
The graph is always supposed running.

* @attention
*
* Copyright (c) 2019(-2022) STMicroelectronics.
* All rights reserved.
*
* This software is licensed under terms that can be found in the LICENSE file
* in the root directory of this software component.
* If no LICENSE file comes with this software, it is provided AS-IS.
*
********************************************************************************
*/

#include <assert.h>
#include <string.h>
#include "main_hooks.h"
#include "st_os.h"
#include "acSdk.h"
#include "stm32_term_cmd.h"
#include "st_os_monitor_cpu.h"
#include "audio_chain_instance.h"
#include "audio_chain_json_from_factory.h"
#include "audio_chain_json_transmission.h"
#include "audio_chain_sysIOs.h"
#include "st_json.h"
#include "audio_persist_config.h"

#define SZ_PROLOG_CHECK_SUM_SIZE        4U
#define SEND_TRANSMISION_BLOCK_SIZE     (70 * 1024)
#define acSDK_HANDLE(handle)            ((acAlgo)handle)
#define MAX_ELEMENT_DIFF                50
#define TYPE_PIN_IN                     0
#define TYPE_PIN_OUT                    1
#define TEMPLATE_SYS_OUT                "{\"Description\":\"Sink Connection point\",\"Icon\":\"icon-elem-sink.png\",\"Name\":\"SysOutChunk1\",\"InstanceMax\":1,\"PinDefIn\":[{\"Name\":\"sink\",\"Type\":\"acChunk\"}]}"
#define TEMPLATE_SYS_IN                 "{\"Description\":\"\",\"Icon\":\"icon-elem-src.png\",\"Name\":\"\",\"InstanceMax\":1,\"PinDefOut\":[{\"disabled\":true,\"ConnectionMax\":1,\"Type\":\"acChunk\"}]}"


static audio_json_transmission *hTransmision;

/**
* @brief   The connection name must be unique, so we compute an unique id
*/
static uint32_t s_compute_cnx_name(const char *pSrcName, const char *pDstName)
{
  uint32_t uname = 0UL;
  while (*pSrcName) { uname += (uint32_t)(*pSrcName++); }
  while (*pDstName) { uname += (uint32_t)(*pDstName++); }
  return uname;
}



/**
* @brief   Returns the chunk id index from its pointer ( probably add it to the SDK)
*/
static int32_t AudioChainSysIOs_getId(audio_chain_sys_connections_t const *const  pConnectionList, audio_chunk_t const *const pChunk)
{
  int32_t id = -1;
  for (int32_t index = 0; index < (int32_t)pConnectionList->nb ; index++)
  {
    if (strcmp(pConnectionList->pConf[index].pVarName, pChunk->pName) == 0)
    {
      id = index;
      break;
    }
  }
  return id;
}


/* Send a block using the raw serial api synchrone */
static bool s_acsdk_send(const void *pBlock, uint32_t szBlock)
{
  return (UTIL_UART_write((void *)pBlock, szBlock) == 0);
}

/* send a command acknowledge for the board */

static bool s_acsdk_cmd_ack(bool result, char *pSuccessCmdMsg, char *pErrorCmdMsg, char *pDesc)
{
  char body[50];

  if (!result)
  {
    snprintf(body, sizeof(body), "{\"Signature\":\"Ack\",\"Title\":\"Message\",\"Text\":\"%s\"}", (pErrorCmdMsg == NULL) ? "" : pErrorCmdMsg);
  }
  else
  {
    snprintf(body, sizeof(body), "{\"Signature\":\"Ack\",\"Title\":\"Message\",\"Text\":\"%s\"}", (pSuccessCmdMsg == NULL) ? "" : pSuccessCmdMsg);
  }
  return audio_json_transmission_send(hTransmision, body, strlen(body), false);
}


static bool s_is_algo_pin_multiple(audio_algo_t *const pAlgo)
{
  const audio_algo_factory_t *const pFactory       = AudioAlgo_getFactory(pAlgo);
  return (((uint32_t)pFactory->pCapabilities->iosOut.nb & (uint32_t)AUDIO_CAPABILITY_CHUNK_MULTIPLE) != 0U);;
}



/**
* @brief return always pin 0 for pinout and pin multiple
*
* @param
*/


static uint8_t s_get_apply_pin_multiple(audio_algo_t *const pAlgo, uint8_t pin)
{
  if (s_is_algo_pin_multiple(pAlgo))
  {
    pin = 0;
  }
  return pin;
}

/**
* @brief add a parameter to the algo instance
*
* @param
*/

static jsonErr s_acsdk_add_params(audio_algo_t *const pAlgo, audio_descriptor_params_t const *pParams, json_instance_t *pJsonInstance, jsonID hParams, char *pBufferValue, uint32_t szBufferValue)
{
  jsonErr error = JSON_OK;
  for (uint8_t index = 0U; index < pParams->nbParams; index++)
  {
    const audio_descriptor_param_t *pParam = &pParams->pParam[index];

    jsonID hObjParam;
    error = json_create_object(pJsonInstance, &hObjParam);
    if (error == JSON_OK)
    {
      error = json_array_append_new(pJsonInstance, hParams, hObjParam);
    }
    if (error == JSON_OK)
    {
      error = json_object_set_string(pJsonInstance, hObjParam, "", "Name", pParam->pName);
    }
    if (error == JSON_OK)
    {
      error = (acAlgoGetConfig(pAlgo, pParam->pName, pBufferValue, szBufferValue) == 0) ? JSON_OK : JSON_ERROR;
    }
    if (error == JSON_OK)
    {
      error = json_object_set_string(pJsonInstance, hObjParam, "", "Value", pBufferValue);
    }
  }
  return error;
}

/**
* @brief add a json connection
*
* @param
*/
static jsonErr s_acsdk_json_connectionAdd(json_instance_t *pJsonInstance, jsonID hCnxs, uint32_t cnxIndex, const char *pInstanceName, uint8_t pinName)
{
  jsonErr error = JSON_OK;
  jsonID  hAttachCnx;
  char    tScratch[30];
  snprintf(tScratch, sizeof(tScratch), "Cnx_%X", cnxIndex);

  error = json_create_object(pJsonInstance, &hAttachCnx);
  if (error == JSON_OK)
  {
    error = json_array_append_new(pJsonInstance, hCnxs, hAttachCnx);
    if (error == JSON_OK)
    {
      error = json_object_set_string(pJsonInstance, hAttachCnx, "", "Name", tScratch);
    }
    if (error == JSON_OK)
    {
      error = json_object_set_string(pJsonInstance, hAttachCnx, "", "InstanceNameDst", pInstanceName);
    }
    if (error == JSON_OK)
    {
      error = json_object_set_integer(pJsonInstance, hAttachCnx, "", "PinDst", (int64_t)pinName);
    }
  }
  return error;
}



/**
* @brief add cnx in to the instance
*
* @param
*/

static jsonErr s_add_instance_connection(audio_algo_list_t *pCurrent, json_instance_t *pJsonInstance, jsonID root, int32_t pinType)
{
  jsonErr error = JSON_OK;
  jsonID hCnxs;
  uint8_t indexPin;
  char tInstaneName[100];

  const char  *pPinDefName = NULL;
  audio_chunk_list_t *pPinList = NULL;
  /* if the pin definition name is different for out/in and the chunk list too */
  if (pinType == TYPE_PIN_IN)
  {
    pPinDefName = "PinDefIn";
    pPinList = AudioAlgo_getChunksIn(pCurrent->pAlgo);
  }
  else if (pinType == TYPE_PIN_OUT)
  {
    /* usually, algos have an unique connection for 1 pindef, but for the out like the split the entry Cnx[] could have several targets */
    pPinDefName = "PinDefOut";
    pPinList = AudioAlgo_getChunksOut(pCurrent->pAlgo);
  }
  else
  {
    error = JSON_ERROR;
  }
  /* Create the array PinDefOut/PinDefIn */
  jsonID hPinDef = JSON_ID_NULL;
  if (error == JSON_OK)
  {
    error = json_create_array(pJsonInstance, &hPinDef);
  }
  if (error == JSON_OK)
  {
    error = json_object_set_new(pJsonInstance, root, pPinDefName, hPinDef);
  }
  if (error == JSON_OK)
  {
    if (!s_is_algo_pin_multiple(pCurrent->pAlgo))
    {
      /* Generate a single connection for each pindef */
      for (indexPin = 0U; (pPinList != NULL) && (error == JSON_OK) ; pPinList = pPinList->next, indexPin++)
      {
        /* Create the PinDefXX[{}] entry and add it */
        jsonID hPindefObj;
        error = json_create_object(pJsonInstance, &hPindefObj);
        if (error == JSON_OK)
        {
          error = json_array_append_new(pJsonInstance, hPinDef, hPindefObj);
        }
        /* create the PinDefXX[{Cnx[]}}] entry and add it */
        error = json_create_array(pJsonInstance, &hCnxs);
        if (error == JSON_OK)
        {
          error = json_object_set_new(pJsonInstance, hPindefObj, "Cnx", hCnxs);
        }
        if (error == JSON_OK)
        {
          if (AudioChunk_getType(pPinList->pChunk) == AUDIO_CHUNK_TYPE_SYS_IN)
          {
            /* if the chunk is a sysin, let's create a connection with a sysin instance */
            audio_chain_sys_connections_t const   *pSysIo = AudioChainSysIOs_getCnxIn();
            audio_chain_sys_connection_conf_t const *pConf = &pSysIo->pConf[AudioChainSysIOs_getId(pSysIo, pPinList->pChunk)];
            snprintf(tInstaneName, sizeof(tInstaneName), "%s-1", pConf->pName);
            error = s_acsdk_json_connectionAdd(pJsonInstance, hCnxs, s_compute_cnx_name(pCurrent->pAlgo->pDesc, tInstaneName), tInstaneName, 0U);
          }
          else if (AudioChunk_getType(pPinList->pChunk) == AUDIO_CHUNK_TYPE_SYS_OUT)
          {
            /* if the chunk is a sysout, let's create a connection with a sysout instance */

            audio_chain_sys_connections_t const   *pSysIo = AudioChainSysIOs_getCnxOut();
            audio_chain_sys_connection_conf_t const *pConf = &pSysIo->pConf[AudioChainSysIOs_getId(pSysIo, pPinList->pChunk)];
            snprintf(tInstaneName, sizeof(tInstaneName), "%s-1", pConf->pName);
            error = s_acsdk_json_connectionAdd(pJsonInstance, hCnxs, s_compute_cnx_name(pCurrent->pAlgo->pDesc, tInstaneName), tInstaneName, 0U);
          }
          else
          {
            /* Otherwise, it is a connection algo to algo pins*/
            audio_algo_t *pAlgoDst;
            uint8_t       ialgoPin;
            /* find in all algo and pins in if the chunk is connected an return the algo found and the pin */
            if (pinType == TYPE_PIN_OUT)
            {
              AudioChain_getChunkAlgoIn(&AudioChainInstance, pPinList->pChunk, &pAlgoDst, &ialgoPin);
            }
            else
            {
              AudioChain_getChunkAlgoOut(&AudioChainInstance, pPinList->pChunk, &pAlgoDst, &ialgoPin);
              ialgoPin = s_get_apply_pin_multiple(pAlgoDst, ialgoPin);
            }

