stm32-hotspot/STM32WBA-Advanced-BLE-Broadcast-Speaker/Middlewares/ST/Audio-Kit/src/helpers/stm32_term_acsdk_tuner.c
            assert(pAlgoDst != NULL);
            error = s_acsdk_json_connectionAdd(pJsonInstance, hCnxs, s_compute_cnx_name(pCurrent->pAlgo->pDesc, pAlgoDst->pDesc), AudioAlgo_getInstanceName(pAlgoDst), ialgoPin);
          }
        }
      }
    }
    else
    {
      /* Generate a single pindef all connections attached in a Cnx Array  */

      jsonID hPindefObj;
      error = json_create_object(pJsonInstance, &hPindefObj);
      if (error == JSON_OK)
      {
        error = json_array_append_new(pJsonInstance, hPinDef, hPindefObj);
      }
      /* create the PinDefXX[{Cnx[]}}] entry and add  it */

      error = json_create_array(pJsonInstance, &hCnxs);
      if (error == JSON_OK)
      {
        error = json_object_set_new(pJsonInstance, hPindefObj, "Cnx", hCnxs);
      }

      for (indexPin = 0U; (pPinList != NULL) && (error == JSON_OK) ; pPinList = pPinList->next)
      {
        if (AudioChunk_getType(pPinList->pChunk) == AUDIO_CHUNK_TYPE_SYS_IN)
        {
          /* if the chunk is a sysin, let's create a connection with a sysin instance */
          audio_chain_sys_connections_t const   *pSysIo = AudioChainSysIOs_getCnxIn();
          audio_chain_sys_connection_conf_t const *pConf = &pSysIo->pConf[AudioChainSysIOs_getId(pSysIo, pPinList->pChunk)];
          snprintf(tInstaneName, sizeof(tInstaneName), "%s-1", pConf->pName);
          error = s_acsdk_json_connectionAdd(pJsonInstance, hCnxs, s_compute_cnx_name(pCurrent->pAlgo->pDesc, tInstaneName), tInstaneName, 0U);
        }
        else if (AudioChunk_getType(pPinList->pChunk) == AUDIO_CHUNK_TYPE_SYS_OUT)
        {
          /* if the chunk is a sysout, let's create a connection with a sysout instance */

          audio_chain_sys_connections_t const   *pSysIo = AudioChainSysIOs_getCnxOut();
          audio_chain_sys_connection_conf_t const *pConf = &pSysIo->pConf[AudioChainSysIOs_getId(pSysIo, pPinList->pChunk)];
          snprintf(tInstaneName, sizeof(tInstaneName), "%s-1", pConf->pName);
          error = s_acsdk_json_connectionAdd(pJsonInstance, hCnxs, s_compute_cnx_name(pCurrent->pAlgo->pDesc, tInstaneName), tInstaneName, 0U);
        }
        else
        {
          /* otherwise, it a connection algo to algo pins out */
          audio_algo_t *pAlgoDst;
          uint8_t       ialgoPin;
          /* find in all algo and pins in if the chunk is connected an return the algo found and the pin */

          if (pinType == TYPE_PIN_OUT)
          {
            AudioChain_getChunkAlgoIn(&AudioChainInstance, pPinList->pChunk, &pAlgoDst, &ialgoPin);
          }
          else
          {
            AudioChain_getChunkAlgoOut(&AudioChainInstance, pPinList->pChunk, &pAlgoDst, &ialgoPin);
          }
          assert(pAlgoDst != NULL);
          error = s_acsdk_json_connectionAdd(pJsonInstance, hCnxs, s_compute_cnx_name(pCurrent->pAlgo->pDesc, pAlgoDst->pDesc), AudioAlgo_getInstanceName(pAlgoDst), indexPin);
        }
      }
    }
  }
  return error;
}


/**
* @brief generate project fake sysio instances
*
* @param
*/

static jsonErr s_generate_sysio_json(json_instance_t *pJsonInstance, jsonID hInstances, int32_t pinType)
{
  jsonErr error = JSON_OK;
  char tInstaneName[100];

  for (audio_algo_list_t *pCurrent = AudioChain_getAlgosList(&AudioChainInstance); (pCurrent != NULL) && (error == JSON_OK); pCurrent = pCurrent->next)
  {
    audio_algo_factory_t *pFactAlgo = (audio_algo_factory_t *)AudioAlgo_getFactory(pCurrent->pAlgo);
    const char  *pPinDefName = NULL;
    audio_chunk_list_t *pPinList = NULL;
    uint8_t     indexPin;
    audio_chain_sys_connections_t const *pSysIo = NULL;
    /* fields and  chunk list are different according to the pin direction */

    if (pinType == TYPE_PIN_IN)
    {
      pPinDefName = "PinDefOut";// the target is pin out
      pPinList = AudioAlgo_getChunksIn(pCurrent->pAlgo);
      pSysIo = AudioChainSysIOs_getCnxIn();

    }
    else if (pinType == TYPE_PIN_OUT)
    {
      pPinDefName = "PinDefIn"; // the target is pin in
      pPinList = AudioAlgo_getChunksOut(pCurrent->pAlgo);
      pSysIo = AudioChainSysIOs_getCnxOut();
    }
    else
    {
      error = JSON_ERROR;
    }
    /* iterate all pins */
    for (indexPin = 0U; (pPinList != NULL) && (error == JSON_OK); pPinList = pPinList->next)
    {
      /* we are iterested only for system chunk */
      uint8_t type = (uint8_t)AudioChunk_getType(pPinList->pChunk);
      if ((type & (uint8_t)AUDIO_CHUNK_TYPE_SYSTEM) != 0U)
      {
        /* get the check configuration */
        audio_chain_sys_connection_conf_t const *pConf = &pSysIo->pConf[AudioChainSysIOs_getId(pSysIo, pPinList->pChunk)];

        /* create an instance object representing the fake sysio */
        jsonID hObj;
        error = json_create_object(pJsonInstance, &hObj);
        if (error == JSON_OK)
        {
          error = json_array_append_new(pJsonInstance, hInstances, hObj);
          if (error == JSON_OK)
          {
            /* a sysio has only one instance so, we can hard code "-1" */
            snprintf(tInstaneName, sizeof(tInstaneName), "%s-1", pConf->pName);
            error = json_object_set_string(pJsonInstance, hObj, "", "InstanceName", tInstaneName);
            /* create the instance header */
            if (error == JSON_OK)
            {
              error = json_object_set_string(pJsonInstance, hObj, "", "RefElement", pConf->pName);
            }
            if (error == JSON_OK)
            {
              error = json_object_set_string(pJsonInstance, hObj, "", "Description", pConf->pDescription);
            }
            /* create an empty array pindef PindefXX[Cnx[]], there is at least one connection */
            jsonID hPinDef;
            error = json_create_array(pJsonInstance, &hPinDef);
            if (error == JSON_OK)
            {
              error = json_object_set_new(pJsonInstance, hObj, pPinDefName, hPinDef);
            }
            jsonID hPindefObj;
            error = json_create_object(pJsonInstance, &hPindefObj);
            if (error == JSON_OK)
            {
              error = json_array_append_new(pJsonInstance, hPinDef, hPindefObj);
            }
            jsonID hCnxs;

            error = json_create_array(pJsonInstance, &hCnxs);
            if (error == JSON_OK)
            {
              error = json_object_set_new(pJsonInstance, hPindefObj, "Cnx", hCnxs);
            }
            if ((type & (uint8_t)AUDIO_CHUNK_TYPE_SINK) != 0U)
            {
              /* a sink is connected to an algo and can be connect to a pin multiple */
              audio_algo_t *pAlgoDst = NULL;
              uint8_t       ialgoPin;
              AudioChain_getChunkAlgoOut(&AudioChainInstance, pPinList->pChunk, &pAlgoDst, &ialgoPin);
              ialgoPin = s_get_apply_pin_multiple(pAlgoDst, ialgoPin);
              assert(pAlgoDst != NULL);
              error = s_acsdk_json_connectionAdd(pJsonInstance, hCnxs, s_compute_cnx_name(tInstaneName, pAlgoDst->pDesc), AudioAlgo_getInstanceName(pAlgoDst), indexPin);
            }
            if ((type & (uint8_t)AUDIO_CHUNK_TYPE_SRC) != 0U)
            {
              audio_algo_t *pAlgoDst = NULL;
              uint8_t       ialgoPin;
              AudioChain_getChunkAlgoIn(&AudioChainInstance, pPinList->pChunk, &pAlgoDst, &ialgoPin);
              assert(pAlgoDst != NULL);
              error = s_acsdk_json_connectionAdd(pJsonInstance, hCnxs, s_compute_cnx_name(tInstaneName, pAlgoDst->pDesc), AudioAlgo_getInstanceName(pAlgoDst), indexPin);
            }
          }
        }
      }
    }
  }
  return error;
}




/**
* @brief Generate a project livetune json from the running graph
*
* @param
*/

static jsonErr s_generate_instances_json(json_instance_t *pJsonInstance, jsonID hInstances)
{
  jsonErr error = JSON_OK;
  uint32_t szBufferValue = 4UL * 1024UL; /* reasonable size for arrays */
  char *pBufferValue = st_os_mem_alloc(ST_Mem_Type_ANY_SLOW, szBufferValue);
  if (pBufferValue)
  {
    if (error == JSON_OK)
    {
      /* iterate all instances used */
      for (audio_algo_list_t *pCurrent = AudioChain_getAlgosList(&AudioChainInstance); pCurrent != NULL; pCurrent = pCurrent->next)
      {
        audio_algo_factory_t *pFactAlgo = (audio_algo_factory_t *)AudioAlgo_getFactory(pCurrent->pAlgo);

        /* create an instance obj to add to the array */
        jsonID hObj;
        error = json_create_object(pJsonInstance, &hObj);
        if (error == JSON_OK)
        {
          error = json_array_append_new(pJsonInstance, hInstances, hObj);
          if (error == JSON_OK)
          {
            /* fill basic header infos */
            error = json_object_set_string(pJsonInstance, hObj, "", "InstanceName", AudioAlgo_getInstanceName(pCurrent->pAlgo));

            if (error == JSON_OK)
            {
              error = json_object_set_string(pJsonInstance, hObj, "", "RefElement", pFactAlgo->pCapabilities->pName);
            }
            if (error == JSON_OK)
            {
              error = json_object_set_string(pJsonInstance, hObj, "", "Description", pCurrent->pAlgo->pDesc); // Instance description
            }
            uint8_t nbParams = 0U;
            if (pFactAlgo->pStaticParamTemplate)
            {
              nbParams += pFactAlgo->pStaticParamTemplate->nbParams;
            }
            if (pFactAlgo->pDynamicParamTemplate)
            {
              nbParams += pFactAlgo->pDynamicParamTemplate->nbParams;
            }
            /* if the algo has parameters, create the param array */
            if (nbParams)
            {
              jsonID hParam;
              json_create_array(pJsonInstance, &hParam);
              assert(hParam != JSON_ID_NULL);
              /* attach the array to the root object */
              json_object_set_new(pJsonInstance, hObj, "Params", hParam);
              if (hParam)
              {
                /* fill static and dynamic params */
                if ((error == JSON_OK) && (pFactAlgo->pStaticParamTemplate != NULL))
                {
                  error = s_acsdk_add_params(pCurrent->pAlgo, pFactAlgo->pStaticParamTemplate, pJsonInstance, hParam, pBufferValue, szBufferValue);
                }
                if ((error == JSON_OK) && (pFactAlgo->pDynamicParamTemplate != NULL))
                {
                  error = s_acsdk_add_params(pCurrent->pAlgo, pFactAlgo->pDynamicParamTemplate, pJsonInstance, hParam, pBufferValue, szBufferValue);
                }
              }
            }
            /* Evaluate instance connection with sys algos/in/out */
            if (error  == JSON_OK)
            {
              error = s_add_instance_connection(pCurrent, pJsonInstance, hObj, TYPE_PIN_IN);
            }
            if (error  == JSON_OK)
            {
              error = s_add_instance_connection(pCurrent, pJsonInstance, hObj, TYPE_PIN_OUT);
            }
          }
        }

