stm32-hotspot/STM32WBA-Advanced-BLE-Broadcast-Speaker/Middlewares/ST/Audio-Kit/src/helpers/stm32_term_acsdk_tuner.c
      }
    }
  }
  if (pBufferValue)
  {
    st_os_mem_free(pBufferValue);
  }
  return error;
}


/**
* @brief Expose platform params
* @param pInstance json instance
* @param root json root id
*/
static bool s_terminal_send_config(void)
{
  bool            bResult = false;
  json_instance_t hJson;
  const char_t   *pJson = NULL;

  memset(&hJson, 0, sizeof(hJson));
  json_create_object(&hJson, &hJson.pack_root);
  if (hJson.pack_root)
  {
    json_object_set_string(&hJson, hJson.pack_root, "", "Signature", "CnxConfig");
    char tScratch[50] = "ID_CUSTOM";
    audio_persist_get_config_id(audio_persist_get_config_cur(), tScratch, sizeof(tScratch));
    json_object_set_string(&hJson, hJson.pack_root, "", "AudioConfig", tScratch);
    snprintf(tScratch, sizeof(tScratch), "HW_%s", STM32_NAME_STRING);
    json_object_set_string(&hJson, hJson.pack_root, "", "HWConfig", tScratch);
    pJson = json_dumps(&hJson, hJson.pack_root, 0);
    json_shutdown(&hJson);
    if (pJson)
    {
      bResult = audio_json_transmission_send(hTransmision, (void *)pJson, strlen(pJson), false);
      json_free((void *)pJson);
    }
  }

  return bResult;
}

/**
* @brief  build the list of element used in the live graph
*/
static int32_t s_build_elements_list(audio_algo_factory_t **pFactoryUsed, int32_t maxFactory)
{
  int32_t nbFactory = 0;
  for (audio_algo_list_t *pCurrent = AudioChain_getAlgosList(&AudioChainInstance); (pCurrent != NULL) && (nbFactory < maxFactory); pCurrent = pCurrent->next)
  {
    audio_algo_factory_t *pFactAlgo = (audio_algo_factory_t *)AudioAlgo_getFactory(pCurrent->pAlgo);
    assert(pFactAlgo != NULL);

    bool found = false;
    for (int32_t indexUsed = 0; indexUsed < nbFactory; indexUsed++)
    {
      if (strcmp(pFactoryUsed[indexUsed]->pCapabilities->pName, pFactAlgo->pCapabilities->pName) == 0)
      {
        found = true;
        break;
      }
    }
    if (!found)
    {
      pFactoryUsed[nbFactory++] = pFactAlgo;
    }
  }

  return nbFactory;
}


/**
* @brief  build the element json
*/
static char *s_build_elements_string(audio_algo_factory_t *pFactory, uint32_t szHeaderDump)
{
  char           *pJson    = NULL;
  json_instance_t jsonInst = {0};
  jsonID          rootID;

  json_create_object(&jsonInst, &rootID);
  if (rootID)
  {
    AudioChainJson_update_element(pFactory, &jsonInst, rootID);
    json_dump_t dump =
    {
      .szDump  = 0,
      .curDump = 0,
      .pDump   = NULL
    };
    /* in case of space reservation before the json */
    if (szHeaderDump != 0U)
    {
      dump.pDump   = st_os_mem_alloc(ST_Mem_Type_ANY_SLOW, szHeaderDump);
      dump.curDump = szHeaderDump;
      dump.szDump  = szHeaderDump;
    }

    pJson = (char *)json_stringify(&jsonInst, rootID, 0, &dump);
    json_shutdown(&jsonInst);
  }
  return pJson;
}

/**
* @brief  Create a json element common header
*/
static char_t *s_sysio_create_element_template(audio_chain_sys_connection_conf_t *pConf, const char_t *pDesc, uint32_t szHeaderDump)
{
  char_t *pDescription = NULL;

  json_instance_t jsonInst = {0};
  jsonID          rootID;
  json_load(&jsonInst, pDesc, &rootID);
  ST_ASSERT(rootID != JSON_ID_NULL);
  if (rootID)
  {
    audio_chunk_conf_t const *pChunConf = AudioChainSysIOs_getConf(pConf->pSysChunk);

    ST_VERIFY(json_object_set_string(&jsonInst, rootID, "", "Description", pConf->pDescription) == JSON_OK);
    ST_VERIFY(json_object_set_string(&jsonInst, rootID, "", "Name", pConf->pName) == JSON_OK);
    ST_VERIFY(json_object_set_string(&jsonInst, rootID, "", "SysIo", "1") == JSON_OK);
    jsonID hParam;
    ST_VERIFY(json_create_array(&jsonInst, &hParam) == JSON_OK);
    ST_VERIFY(json_object_set_new(&jsonInst, rootID, "Params", hParam) == JSON_OK);
    AudioChainJson_json_add_param(&jsonInst, hParam, -1, NULL, 0, "variable", NULL, "sysio", NULL, pConf->pVarName, 0.0F, 0.0F, TRUE);
    /* in case of space reservation before the json */
    json_dump_t dump =
    {
      .szDump  = 0,
      .curDump = 0,
      .pDump   = NULL
    };

    if (szHeaderDump != 0U)
    {
      dump.pDump   = st_os_mem_alloc(ST_Mem_Type_ANY_SLOW, szHeaderDump);
      dump.curDump = szHeaderDump;
      dump.szDump  = szHeaderDump;
    }
    pDescription = (char_t *)json_stringify(&jsonInst, rootID, 0, &dump);
    json_shutdown(&jsonInst);
  }

  return pDescription;
}



/**
* @brief  Create a json sysio element
*/
static bool  s_sysio_create_element(const audio_chain_sys_connections_t *pSysCnx, const char *pTemplate, int32_t *pIndexElem)
{
  bool bResult  = false;
  uint32_t nbSysIo = pSysCnx->nb;
  char headerJson[50];


  for (uint32_t indexSysCnx = 0; indexSysCnx < nbSysIo ; indexSysCnx++)
  {
    snprintf(headerJson, sizeof(headerJson), "{\"Signature\":\"Element\",\"Num\":%d,\"Element\":", *pIndexElem);
    (*pIndexElem)++;
    uint32_t szHeaderDump = strlen(headerJson);

    char_t *pDescription = s_sysio_create_element_template(&pSysCnx->pConf[indexSysCnx], pTemplate, szHeaderDump);
    bResult  = false;
    if (pDescription)
    {
      /* Copy the header in the provisioned size */
      memcpy(pDescription, headerJson, szHeaderDump);
      /* grow the buffer to add the terminator */
      pDescription = st_os_mem_realloc(ST_Mem_Type_ANY_SLOW, pDescription, strlen(pDescription) + 2U);

      if (pDescription)
      {
        /* add the terminator */
        strcat(pDescription, "}");
        UTIL_TERM_Mute(UTIL_TERM_MUTE_LOG_FORCE_OFF);
        bResult = audio_json_transmission_send(hTransmision, pDescription, strlen(pDescription), false);
        UTIL_TERM_Mute(UTIL_TERM_MUTE_LOG_FORCE_ON);
      }
    }
    if (!bResult)
    {
      break;
    }
    if (pDescription)
    {
      json_free(pDescription);
    }
    st_os_task_delay(1);
  }
  return bResult;
}




static bool s_create_elements(audio_algo_factory_t **pFactoryUsed, int32_t nbElements, int32_t *pIndexElem)
{
  bool bResult  = false;

  char headerJson[50];
  for (int32_t indexElem = 0; indexElem < nbElements; indexElem++)
  {
    audio_algo_factory_t  *pFactory = pFactoryUsed[indexElem];
    snprintf(headerJson, sizeof(headerJson), "{\"Signature\":\"Element\",\"Num\":%d,\"Element\":", *pIndexElem);
    (*pIndexElem)++;
    assert(strlen(headerJson) < (sizeof(headerJson) - 1U));
    char *pJsonDesc = s_build_elements_string(pFactory, strlen(headerJson));
    if (pJsonDesc)
    {
      /* Copy the header in the provisioned size */
      memcpy(pJsonDesc, headerJson, strlen(headerJson));
      /* grow the buffer to add the terminator */
      char *pJsonFinal = st_os_mem_realloc(ST_Mem_Type_ANY_SLOW, pJsonDesc, strlen(pJsonDesc) + 2U);
      if (pJsonFinal)
      {
        /* add the terminator */
        strcat(pJsonFinal, "}");
        /* send the payload */
        UTIL_TERM_Mute(UTIL_TERM_MUTE_LOG_FORCE_OFF);
        bResult = audio_json_transmission_send(hTransmision, pJsonFinal, strlen(pJsonFinal), false);
        UTIL_TERM_Mute(UTIL_TERM_MUTE_LOG_FORCE_ON);
      }
      else
      {
        /* if a realloc return null, the pointer to grow is not freed */
        st_os_mem_free((void *)pJsonDesc);
      }
      st_os_mem_free((void *)pJsonFinal);
    }
    else
    {
      bResult = false;
    }
    st_os_task_delay(1);
  }
  return bResult;
}





/**
* @brief  Export the json elements
*
* @param argc  num args
* @param argv  args list
*/
static bool s_build_elements(audio_algo_factory_t **pFactoryUsed, int32_t nbElements)
{
  bool bResult = true;
  int32_t indexElem = 0;
  /* send first fake element sysin and sysout */
  if (!s_sysio_create_element(AudioChainSysIOs_getCnxIn(), TEMPLATE_SYS_IN, &indexElem))
  {
    bResult = false;
  }
  if (!s_sysio_create_element(AudioChainSysIOs_getCnxOut(), TEMPLATE_SYS_OUT, &indexElem))
  {
    bResult = false;
  }

