stm32-hotspot/STM32WBA-Advanced-BLE-Broadcast-Speaker/Middlewares/ST/Audio-Kit/src/helpers/stm32_term_acsdk_tuner.c
  if (!s_create_elements(pFactoryUsed, nbElements, &indexElem))
  {
    bResult = false;
  }

  if (!bResult)
  {
    UTIL_TERM_printf_cr("Error: Send elements");
  }
  return bResult;
}





/**
* @brief  export the json instances ( .livetune file )
*
* @param argc  num args
* @param argv  args list
*/
static void stm32_term_acsdk_cmd_get_instances(int argc, char *argv[])
{
  bool     bOk      = false;
  uint16_t dumpFlag = 0U;
  bool     bResult  = false;

  /* compact produces a json without indentation, it is faster to download */
  if (argc == 1)
  {
    bOk = true;
  }
  else if (argc == 2)
  {
    if (strcmp(argv[1], "formatted") == 0)
    {
      bOk      = true;
      dumpFlag = JSON_INDENT;
    }
  }
  else
  {
    UTIL_TERM_printf_cr("%s command: wrong number of arguments", argv[0]);
  }
  if (bOk)
  {
    bResult = s_terminal_send_config();
    if (bResult)
    {
      jsonErr error = JSON_OK;
      const char     *pJson = NULL;
      json_instance_t jsonInst;
      memset(&jsonInst, 0, sizeof(jsonInst));
      json_create_object(&jsonInst, &jsonInst.pack_root);
      if (jsonInst.pack_root)
      {
        /* format the header instances */
        if (error == JSON_OK)
        {
          error = json_object_set_string(&jsonInst,  jsonInst.pack_root, "", "Signature", "Instance");
        }
        if (error == JSON_OK)
        {
          error = json_object_set_string(&jsonInst,  jsonInst.pack_root, "", "Version", AC_VERSION);
        }
        if (error == JSON_OK)
        {
          error = json_object_set_boolean(&jsonInst, jsonInst.pack_root, "", "Editable", 0);
        }
        if (error == JSON_OK)
        {
          error = json_object_set_string(&jsonInst, jsonInst.pack_root, "", "ProjectType", "AudioKit");
        }

        if (error == JSON_OK)
        {
          error = json_object_set_integer(&jsonInst, jsonInst.pack_root, "", "InstanceMax", 100);
        }
        if (error == JSON_OK)
        {
          error = json_object_set_integer(&jsonInst, jsonInst.pack_root, "", "ConnectionOutMax", 100);
        }
        if (error == JSON_OK)
        {
          error = json_object_set_integer(&jsonInst, jsonInst.pack_root, "", "ConnectionInMax", 100);
        }

        jsonID hInstances;
        error =  json_create_array(&jsonInst, &hInstances);
        if (error == JSON_OK)
        {
          error =  json_object_set_new(&jsonInst, jsonInst.pack_root, "Instances", hInstances);
        }
        /* add instance realy used in this graph */
        if (error == JSON_OK)
        {
          error = s_generate_instances_json(&jsonInst, hInstances) ;
        }
        /* add fake sysio */
        if (error == JSON_OK)
        {
          error = s_generate_sysio_json(&jsonInst, hInstances, TYPE_PIN_IN);
        }
        if (error == JSON_OK)
        {
          error = s_generate_sysio_json(&jsonInst, hInstances, TYPE_PIN_OUT);
        }
        if (error == JSON_OK)
        {
          pJson = json_dumps(&jsonInst, jsonInst.pack_root, dumpFlag);
          if (pJson != NULL)
          {
            bResult = true;
          }
        }
      }
      json_shutdown(&jsonInst);
      if (pJson)
      {
        bResult = audio_json_transmission_send(hTransmision, (void *)pJson, strlen(pJson), false);
        json_free((char *)pJson);
      }
    }
  }
  bResult = s_acsdk_cmd_ack(bResult, NULL, "Error: Load Instance", "get_instances");
  assert(bResult);
}


/**
* @brief  Export the json elements
*
* @param argc  num args
* @param argv  args list
*/
static void stm32_term_acsdk_cmd_get_elements(int argc, char *argv[])
{
  bool                  bResult = false;
  audio_algo_factory_t *tFactory[MAX_ELEMENT_DIFF];
  int32_t               nbElements = s_build_elements_list(tFactory, MAX_ELEMENT_DIFF);

  if (nbElements)
  {
    bResult = s_build_elements(tFactory, nbElements);
  }

  bResult = s_acsdk_cmd_ack(bResult, NULL, "Error: Get element", "get_elements");
  assert(bResult);
}


/**
* @brief  Apply the parameter
*/

static void stm32_term_acsdk_apply(const char *pInstanceName, const char *pName, const char *pValue, int64_t type)
{
  int32_t error = 0;
  acAlgo hAlgo = acAlgoGetInstance((acPipe)&AudioChainInstance, pInstanceName);
  if (hAlgo)
  {
    const audio_algo_factory_t *pFactory = AudioAlgo_getFactory(hAlgo);

    if (pFactory == NULL)
    {
      UTIL_TERM_printf_cr("no algo factory");
      error = AUDIO_ERR_MGNT_ALLOCATION;
    }
    else
    {
      const audio_descriptor_param_t *pParam = NULL;

      error = AudioDescriptor_getParam(pFactory->pDynamicParamTemplate, pName, &pParam, NULL);
      if (error == AUDIO_ERR_MGNT_NOT_FOUND)
      {
        error = AudioDescriptor_getParam(pFactory->pStaticParamTemplate, pName, &pParam, NULL);
      }
      if (error == AUDIO_ERR_MGNT_NOT_FOUND)
      {
        UTIL_TERM_printf_cr("param called %s not found in factory of %s", pName, pFactory->pCapabilities->pName);
      }
      else if (error == 0)
      {
        char_t *pTranslated = AudioChainJson_factory_translate_key_value(pParam, pValue);
        error = acAlgoSetConfig(hAlgo, pName, pTranslated);
        st_os_mem_free(pTranslated);
      }
    }

    if (error == 0)
    {
      if (type == 0)
      {
        error = acAlgoRequestUpdate(hAlgo);
      }
    }
  }
  if (error != 0)
  {
    UTIL_TERM_printf_cr("Apply Algo %s:%s fails", pInstanceName, pName);
  }
}




/**
* @brief  the board connect livetune
*
* @param argc  num args
* @param argv  args list
*/

static void stm32_term_acsdk_connect(int argc, char *argv[])
{
  /* send a sync message in order to purge the serial queue */
  bool bResult = audio_json_transmission_send_sync(hTransmision);
  assert(bResult);

  /* send the ack to prevent no response message  */
  bResult = s_acsdk_cmd_ack(true, NULL, "Error: Connect", "Connect");
  assert(bResult);

  stm32_term_acsdk_cmd_get_elements(argc, argv);
  /* send the project */
  stm32_term_acsdk_cmd_get_instances(argc, argv);
}


/*Example message : Update:{"update":{"Instances":[{"InstanceName":"faust-reverb-dattorro-1","Params":[{"Name":"diffusion_wall4","Value":0}]}]}}*/
static jsonErr stm32_term_acsdk_apply_update(const char *pJson)
{
  UTIL_TERM_printf_cr("%s", pJson);

  jsonErr error = JSON_ERROR;
  json_instance_t jsonInst = {0};
  /* load the json */
  json_load(&jsonInst, pJson, &jsonInst.pack_root);
  if (jsonInst.pack_root)
  {
    /*verify the array update*/
    jsonID hUpdate;
    json_object_get_id_from_tree(&jsonInst, jsonInst.pack_root, "update", &hUpdate);
    if (hUpdate)
    {

      /* verify array instances */
      const char   *pInstanceName = "";
      const char   *pName = "";
      const char   *pValue = "";
      int64_t       type = 0;
      error = JSON_OK;

      jsonID hInstance;
      json_object_get_id_from_tree(&jsonInst, hUpdate, "Instances", &hInstance);
      if (hInstance)
      {
        uint16_t count;
        json_list_get_count(&jsonInst, hInstance, &count);
        for (uint16_t indexInst = 0; (indexInst < count) && (error == JSON_OK); indexInst++)
        {
          /* read the object instance */
          jsonID valueID;
          error = json_list_pair(&jsonInst, hInstance, indexInst, NULL, &valueID);
          if (error  == JSON_OK)
          {
            type = 0;

            /* type is optional, (0) by default apply immediately, (1) don't apply, so return an error but we ignore it  */
            json_object_get_integer(&jsonInst, valueID, "", "Type", &type);
          }
          /* instance name   */
          if (error  == JSON_OK)
          {
            error = json_object_get_string(&jsonInst, valueID, "", "InstanceName", &pInstanceName);
          }
          jsonID hParams;
          error = json_array_get(&jsonInst, valueID, "Params", &hParams);
          if (error  == JSON_OK)
          {
            uint16_t countParam;
            json_list_get_count(&jsonInst, hParams, &countParam);
            for (uint16_t indexParam = 0; (indexParam < countParam) && (error == JSON_OK); indexParam++)
            {
              /* read the object instance */
              jsonID objectID;
              error = json_list_pair(&jsonInst, hParams, indexInst, NULL, &objectID);
              if (error == JSON_OK)
              {
                error = json_object_get_string(&jsonInst, objectID, "", "Name", &pName);
              }
              if (error == JSON_OK)
              {
                error = json_object_get_string(&jsonInst, objectID, "", "Value", &pValue);
              }
              if (error == JSON_OK)
              {
                stm32_term_acsdk_apply(pInstanceName, pName, pValue, type);
              }
            }
          }
        }
      }
    }
  }
  return error;
}


/**
* @brief  Update the json instances
*
* @param argc  num args
* @param argv  args list
*/
static void stm32_term_acsdk_cmd_update_instances(int argc, char *argv[])
{
  bool     bOk     = false;
  bool     bResult = false;
  uint32_t syncTmo = 60UL;
  char    *pJson   = NULL;
  uint32_t szRead;

  if (argc == 1)
  {
    bOk = true;
  }
  if (bOk)
  {
    int32_t  error = UTIL_TERM_receive_file(&pJson, &szRead, syncTmo * 1000UL);
    UTIL_TERM_Mute(UTIL_TERM_MUTE_LOG_FORCE_ON);
    if ((szRead > 0UL) && (error == UTIL_ERROR_NONE))
    {
      bResult = (stm32_term_acsdk_apply_update(pJson) == JSON_OK);
    }
    else
    {
      UTIL_TERM_printf_cr("Aborted or error");
    }
  }
  if (pJson)
  {
    st_os_mem_free(pJson);
  }
  bResult = s_acsdk_cmd_ack(bResult, NULL, "Error: Update", "update_instances");
  assert(bResult);
}


/* hooks the terminal to init the transmission */

void UTIL_TERM_Initialized(UTIL_TERM_t *gContext);
void UTIL_TERM_Initialized(UTIL_TERM_t *gContext)
{
  /* make sure json uses st_os_mem */
  json_set_alloc_funcs(st_os_mem_generic_realloc_slow, st_os_mem_generic_free);
  hTransmision = audio_json_transmission_init(SEND_TRANSMISION_BLOCK_SIZE);
  assert(hTransmision != NULL);
  audio_json_transmission_set_cb(hTransmision, s_acsdk_send, NULL);
}



TERM_CMD_DECLARE("get_elements",     NULL,          "Export the json elements", stm32_term_acsdk_cmd_get_elements);
TERM_CMD_DECLARE("connect",          NULL,          "Connect the target",       stm32_term_acsdk_connect);
TERM_CMD_DECLARE("get_instances",    "[formatted]", "Export the json instance", stm32_term_acsdk_cmd_get_instances);
TERM_CMD_DECLARE("update_instances", NULL,          "Update the graph",         stm32_term_acsdk_cmd_update_instances);
